#include "stc12c5a60s2.h"
#include "UART.h"


/*------------------------------------------------
              串口通讯初始化
------------------------------------------------*/
void UART_Init(void)
{
    SCON  = 0x50;		        // SCON: 模式 1, 8-bit UART, 使能接收  
    TMOD |= 0x20;               // TMOD: timer 1, mode 2, 8-bit 重装
    TH1   = 0xFD;               // TH1:  重装值 9600 波特率 晶振 11.0592MHz  
    TR1   = 1;                  // TR1:  timer 1 打开 
//	EA    = 1;                  //打开总中断
    ES    = 1;                  //打开串口中断  
	TI=1;                     
}



/*------------------------------------------------
                    发送一个字节
------------------------------------------------*/
void SendByte_UART(unsigned char dat)
{
 SBUF = dat;
 while(!TI);
      TI = 0;
}
/*------------------------------------------------
                    发送一个字符串
------------------------------------------------*/
void SendStr(unsigned char *s)
{
 while(*s!='\0')// \0 表示字符串结束标志，
                //通过检测是否字符串末尾
  {
  SendByte_UART(*s);
  s++;
  }
}

